{
  "posts": [
    {
      "id": "1",
      "title": "json-server",
      "userId": "1"
    },
    {
      "id": "2",
      "title": "json-server",
      "userId": "2"
    }
  ],
  "notifications": [
    {
      "id": "1",
      "title": "Новая статья",
      "description": "Добавилась новая статья в разделе IT",
      "userId": "1"
    },
    {
      "id": "2",
      "title": "Просмотры",
      "description": "Ваша статья набрала более 1000 просмотров",
      "userId": "1",
      "href": "http://localhost:3000/admin"
    },
    {
      "id": "3",
      "title": "Новая статья",
      "description": "Добавилась новая статья в разделе SCIENCE",
      "userId": "1",
      "href": "http://localhost:3000/admin"
    },
    {
      "id": "4",
      "title": "Рекорды сайта",
      "description": "В прошлом месяце сайт посетило более 100 000 человек",
      "userId": "1"
    },
    {
      "id": "5",
      "title": "Обновление сайта",
      "description": "Представляем вам новую версию сайтае",
      "userId": "2"
    }
  ],
  "articles": [
    {
      "id": "1",
      "title": "Глава «Тинькофф» заявил о «жутком дефиците» IT-специалистов",
      "subtitle": "",
      "img": "/images/41237623a6134e13b5ac206e5217839d.png",
      "views": 123,
      "createdAt": "10.11.2023",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "На рынке ощущается «жуткий дефицит» IT-специалистов, заявил глава Тинькофф Банка Станислав Близнюк на форуме Finopolis-2023.",
            "«Когда человек выходит на рынок IT, он через три дня получает пять-семь оферов, причём с повышением. Просто жуткий дефицит (кадров). К чему дефицит приводит? К двум последствиям. Одно последствие — это что цена подрастёт, это вызов для многих компаний», — заявил Близнюк.",
            "Второе последствие дефицита кадров, по словам Близнюка, — снижение их качества. «Вторая проблематика — когда у тебя супердефицит, то у тебя и качество кадров ухудшается. Потому что, в общем и целом, зачем учиться, если и так тебя возьмут при нескольких накаченных скилах. С пониманием, что кадры растут в стоимости, а качество падает, мы эту проблему понимаем и чувствуем», — добавил он. Сам «Тинькофф» с этой проблемой пока особо не столкнулся, но почувствует её в перспективе трёх-пяти лет, считает Близнюк.",
            "В сентябре глава Сбербанка Герман Греф заявил, что дефицит IT-специалистов в России составляет сейчас больше 1 млн человек. «По всем нашим оценкам, которые, наверное, можно пока ограничить горизонтом в пять-шесть лет, дефицит специалистов в области цифровых технологий будет только нарастать, несмотря на увеличивающиеся программы приёма в вузах и открывающиеся специальные школы подготовки», — отметил глава Сбербанка."
          ]
        }
      ]
    },
    {
      "id": "2",
      "title": "Что нового в .NET 8?",
      "subtitle": "",
      "img": "/images/cf5a155764adaf18e4685dcaabccbe22.png",
      "views": 14,
      "createdAt": "14.11.2023",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            ".NET 8 вышел в релиз, значит можно начинать переносить свои проекты на новую версию. В этой статье мы рассмотрим новые улучшения и фишки: C# 12, производительность, Native AOT, GC, новые типы, направленные на повышение производительности, NuGet Audit и прочее."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "C# 12",
          "paragraphs": [
            "По нововведениям C# 12 мы уже прошлись в отдельной статье. В ней мы затронули новые особенности языка: первичные конструкторы, параметры по умолчанию, collection expressions, inline массивов и остальное. В этот раз изменений не очень много. А как вы оцениваете обновление языка? Мы вот взглянули, и сразу появились идеи для новых правил C# анализатора.",
            "Кстати, раз уж речь зашла про анализатор, сделаю небольшой анонс. Мы уже работаем над поддержкой .NET 8 и C# 12 — она появится в PVS-Studio 7.28. Релиз запланирован на начало декабря, и чтобы его не пропустить, приглашаю подписаться на рассылку пресс-релизов.",
            "Microsoft сказали, что представленный в прошлом году .NET 7 очень быстрый, но .NET 8 быстрее. И это действительно так. Stephen Toub в присущей ему манере рассказал про улучшения производительности в .NET 8. Это статья на сотни страниц, охватывающая если не все, то большинство улучшений. Усовершенствования коснулись таких вещей, как JIT, GC, рефлексия, коллекции, LINQ, кодогенерация, сериализция и десериализция, примитивные типы и многое другое.",
            "В статье очень большое внимание уделено сравнению производительности .NET 7 и .NET 8, много сравнительных таблиц. Заходите почитать, я думаю, что каждый найдёт там что-то интересное."
          ]
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Новые типы, нацеленные на производительность",
          "paragraphs": [
            "В .NET 8 были добавлены типы, нацеленные на производительность в различных сценариях. Теперь у разработчиков появились коллекции FrozenDictionary<TKey, TValue> и FrozenSet<T>, которые находятся в пространстве имён System.Collections.Frozen. Новые коллекции обеспечивают неизменяемость ключей или значений после создания. Это позволяет их специально оптимизировать для операций чтения. Довольно полезное нововведение для случаев, когда коллекция заполняется при первом использовании и хранится в течение длительного времени. Пример использования:"
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "private static readonly FrozenDictionary<string, bool> _settings = \n  GetSettings().ToFrozenDictionary();\n....\nif (_settings.TryGetValue(key, out bool setting))\n{\n    //....\n}"
        }
      ]
    },
    {
      "id": "3",
      "title": "Amazon разработала собственную ОС вместо Android для своей экосистемы устройств.",
      "subtitle": "Что это за проект?",
      "img": "/images/a0690b933fc95c6c915f14ca76502503.jpg",
      "views": 211,
      "createdAt": "14.11.2023",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "На днях стало известно о том, что корпорация Amazon разработала операционную систему. Она, насколько можно судить по общедоступной информации, предназначена для установки на собственные устройства — сначала небольшой ряд моделей. Если всё пройдёт хорошо, её будут использовать для всей экосистемы устройств. Подробности о проекте — под катом."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Что это за система?",
          "paragraphs": [
            "Базируется она на ядре Linux, называется проект Vega или Vega OS, вероятнее всего, это название будет использоваться и в дальнейшем. Разработчики постарались максимально оптимизировать код операционной системы для того, чтобы там не было ненужных компонентов — тех, что не нужны гаджетам от Amazon.",
            "Базируется она на фреймворке React Native, что даёт возможность разрабатывать софт, который работает автономно, без браузера. Тем не менее весь проект является web-based.",
            "Поначалу ОС станут устанавливать в умных устройствах компании, включая Smart TV, разного рода мультимедийное «железо», компоненты умного дома. Пример — известные многим Amazon Fire TV и Amazon Echo."
          ]
        },
        {
          "id": "3",
          "type": "IMAGE",
          "src": "/images/a4074b5d2c67b3acac79a4516098b229.png",
          "title": ""
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Затем, если всё пройдёт хорошо, операционную систему станут устанавливать вообще на всех девайсах Amazon, которые сейчас работают с Android. Кроме того, эту же ОС будут использовать для обеспечения работы новых моделей гаджетов, которых пока нет в продаже.",
            "Насколько известно, Vega OS уже готова, осталось только доработать некоторые моменты, а также предложить разработчикам SDK. Это делается для того, чтобы уже экосистему приложений под новую операционную систему готовили не только сотрудники Amazon, но и сторонние разработчики. Первое «железо» с новой операционной системой начнут поставлять примерно в начале 2024 года.",
            "Интересно, что операционная система появилась не вдруг. Над ней работала большая команда из нескольких сотен специалистов начиная с 2019 года. С 2022 года Amazon старалась переманивать профессионалов к себе в команду. Среди них оказался, например, Зиби Бранецки (Zibi Braniecki из Mozilla, достаточно известный JavaScript-разработчик). К слову, он как-то написал, что работает над следующим поколением ОС для самых разных устройств экосистемы Amazon. Ну а началась работа над проектом ещё в 2019 году.",
            "Система уже была протестирована на потоковых адаптерах Fire TV, и Amazon проинформировала избранных партнёров о своих планах по переходу на новую платформу приложений в ближайшем будущем."
          ]
        }
      ]
    },
    {
      "id": "4",
      "title": "Семь приемов в Excel, которые делают диаграммы профессиональными",
      "subtitle": "",
      "img": "/images/00d9d3316dd4097326d713b27cf62cb9.jpeg",
      "views": 862,
      "createdAt": "12.10.2023",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Хотя сейчас я работаю в ИТ-отрасли, много лет назад я верстал рекламную газету, и с тех пор дизайн – мой профессиональный навык и увлечение за пределами профессии.",
            "Сделать диаграммы привлекательными гораздо проще, чем вы думаете. Получить рекомендации на все случаи жизни не выйдет, но освоить несколько приемов в Excel и узнать азы теории, вы сможете за 10 минут. ",
            "Из тридцатилетнего опыта и десятков прочитанных книг я выбрал семь полезных приемов. Их мы и разберем в этой статье в блоге ЛАНИТ."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Чтобы оценить «что такое хорошо», начнем с неудачного примера. Динамика продаж мониторов из отчета известного аналитического агентства послужит нам базой для разбора ошибок в дизайне диаграммы."
          ]
        },
        {
          "id": "3",
          "type": "IMAGE",
          "src": "/images/2def4a0bb97635b1a2256850a24de9d7.jpeg",
          "title": "Рис. 1. Динамика продаж"
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "Прием 1. Уменьшите боковой зазор",
          "paragraphs": [
            "Выделите диапазон А1:В13 и пройдите по меню Вставка –> Рекомендуемые диаграммы –> Гистограмма с группировкой. Нажмите Ok."
          ]
        },
        {
          "id": "5",
          "type": "IMAGE",
          "src": "/images/8e84067fe9f6da5edfe9b4035ab2b78f.jpeg",
          "title": "Рис. 2. Гистограмма с группировкой; по умолчанию боковой зазор равен 219%"
        }
      ]
    },
    {
      "id": "5",
      "title": "Digital-мероприятия в Москве c 13 по 19 ноября",
      "subtitle": "",
      "img": "/images/qwt8ey1sv2tnbiydmbxzd2myzb8.jpeg",
      "views": 2354,
      "createdAt": "15.10.2023",
      "userId": "1",
      "type": [
        "ECONOMICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Подборка мероприятий на неделю."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "The Trends",
          "paragraphs": [
            "15 ноября (среда) — 16 ноября (четверг)",
            "Ленинская слобода Loft 2 и 3",
            "от 5 600 р.",
            "Форум «The Trends 2023» в Москве, 15-16 ноября, представляет новую парадигму в event-индустрии. Билеты становятся искусством, форум — игрой. На форуме будут обсуждать новейшие глобальные тренды: искусственный интеллект, блокчейн, майнинг, ЦФА, инфлюенс маркетинг и многое другое. Приглашены предприниматели, представители крупных компаний, новаторы, контент-мейкеры, инвесторы, разработчики, аналитики, и журналисты."
          ]
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Главный форум про рекрутинг НАЁМ",
          "paragraphs": [
            "16 ноября (четверг)",
            "Покровка 47",
            "бесплатно",
            "Рекрутеры — движущая сила бизнеса. Профессионалы подбора помогают компаниям строить сильные команды и достигать вместе с ними невероятных результатов. Об этом важно помнить самим и дать понять это коллегам. Мы хотим показать важность профессии рекрутера — и самим специалистам, и топ-менеджерам компаний.\nПоэтому организовали главный форум про рекрутинг в России — НАЁМ.",
            "16 ноября более 500 рекрутеров, HR-менеджеров, руководителей подбора и директоров по персоналу соберутся на форуме НАЁМ в Москве, чтобы поговорить о своей роли в бизнесе, достижении карьерных высот и передовых инструментах подбора."
          ]
        }
      ]
    },
    {
      "id": "6",
      "title": "Оформляем README-файл профиля на GitHub",
      "subtitle": "",
      "img": "/images/c0fe908fde36e755906d870b0056527b.jpg",
      "views": 1635,
      "createdAt": "02.02.2022",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Летом 2020 года GitHub позволила пользователям создавать персональные README-файлы и с их помощью кастомизировать свои профили. Сама платформа при создании подобного файла предлагает уже готовый шаблон, в который можно вписать свои данные. Но о какой кастомизации может идти речь, если у всех будут одинаково оформленные профили? За почти два года сообщество придумало множество различных способов выделиться и особенно оформить свою страницу на GitHub."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "/images/c0fe908fde36e755906d870b0056527b.jpeg",
          "title": ""
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Создаем README.md профиля",
          "paragraphs": [
            "Для того чтобы создать README-файл, который будет отображаться в профиле, необходимо создать новый публичный репозиторий с названием, полностью повторяющим никнейм пользователя. Также важно не забыть поставить галочку в поле, предлагающем вместе с репозиторием создать и README.md. Во время настройки репозитория нас поздравит Октокот и сообщит о том, что только что мы создали особенный репозиторий и его содержимое будет отображаться на странице профиля. GitHub автоматически сделает базовый шаблон, в который можно вписать информацию о себе, а можно не вписывать и сделать что-то чуть более интересное."
          ]
        },
        {
          "id": "4",
          "type": "IMAGE",
          "src": "/images/4f1a3e2a02102193709d2055f7309e1d.png",
          "title": "Официальный профиль Октокота с базовым README профиля"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Для редактирования файла понадобятся знание Markdown-разметки и базовое понимание HTML. Оба навыка не сложны в освоении и интуитивно понятны в том объеме, который необходим для кастомизации профиля. На самом деле можно ограничиться только Markdown, но его особенность в том, что текст автоматически выравнивается по левому краю и нет никакой возможности повлиять на это. А HTML в тандеме с Markdown позволяет контролировать расположение объектов на экране. Для создания интерактивных блоков понадобится понимание того, как устроен сервис GitHub Actions, но нужны тоже только лишь базовые знания. Глубокие понадобятся только в том случае, если захочется создать собственный динамический виджет."
          ]
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "Заголовок",
          "paragraphs": [
            "Как уже и говорилось ранее, заголовки можно писать как с помощью Markdown, так и с помощью HTML. Последний способ поможет разместить текст по центру, что мне больше нравится — выделяется на фоне основного текста. Заголовок обычно содержит в себе приветствие, обращенное к посетителю профиля. Имя в моем заголовке оформлено в виде ссылки и ведет на сайт-визитку, в конце расположен эмодзи с машущей рукой, значок анимированный. Второй строчкой можно коротко рассказать о своей деятельности, чтобы посетителю сразу было ясно, с кем он имеет дело."
          ]
        },
        {
          "id": "7",
          "type": "IMAGE",
          "src": "/images/917d2527c0cac4b39d2945d14b5813ed.png",
          "title": "Заголовок в моем профиле"
        },
        {
          "id": "8",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Оформляется все это дело вот такой нехитрой HTML-конструкцией:"
          ]
        },
        {
          "id": "9",
          "type": "CODE",
          "code": "<h1 align=\"center\">Hi there, I'm <a href=\"https://daniilshat.ru/\" target=\"_blank\">Daniil</a> \n<img src=\"https://github.com/blackcater/blackcater/raw/main/images/Hi.gif\" height=\"32\"/></h1>\n<h3 align=\"center\">Computer science student, IT news writer from Russia 🇷🇺</h3>"
        }
      ]
    },
    {
      "id": "7",
      "title": "Революция от OpenAI",
      "subtitle": "полный обзор: что означают последние анонсы для продуктовой разработки",
      "img": "/images/8852ae5087f90ec75827d52835aac06e.png",
      "views": 7900,
      "createdAt": "11.07.2023",
      "userId": "1",
      "type": [
        "ECONOMICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Неделю назад я получил уведомление о начале трансляции первой разработческой конференции от OpenAI. Было неудобно смотреть эфир живьём, так что уложил детей спать, и ночью, заварив себе какао, с предвкушением открыл YouTube. ",
            "Конечно, я к тому времени не выдержал и посмотрел краткие описания анонсов, так что был готов к тому, что увижу, но скажу честно: не смотря на презентацию в стиле студенческих конференций (на финальный слайд (под катом) вообще без слёз не взглянешь), чем дольше слушал об анонсах, тем больше у меня отвисала челюсть. ",
            "Это не просто небольшие улучшения; это действительно скачок вперёд. Я слушаю про увеличение длины контекста до 128К, обновлении данных до апреля текущего года, об интеграции в API интерпретатора, нового \"рисователя\" DALLE-3, анализ изображений, извлечение данных из массивов, безлимитных \"ассистентов\" и чуть ли не подпрыгиваю на стуле от оживления: решилось огромное количество проблем, которые до этого требовали человеко-месяцы доработки довольно квалифицированной командой.",
            "Как только презентация подходит к концу, я судорожно открываю беклог и начинаю записывать и редактировать идеи. Уверен, что перед разработчиками открыли действительно большие возможности, которые переопределят способ разработки и восприятия продуктов. И если тема AI вас как минимум интересует и вы ещё и занимаетесь продуктовой разработкой, а перепосченных по 150 раз новостей не хватает понять, что это значит лично для вас и команды, этот обзор будет весьма кстати. "
          ]
        },
        {
          "id": "82",
          "type": "IMAGE",
          "src": "/images/69d05c34d0665cee888b7cdc44880822.png",
          "title": ""
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "GPT-4-Turbo с контекстом в 128К токенов",
          "paragraphs": [
            "Токены - это части текста, с которыми работает модель, для английского текста обычно 1 токен = 4 символа, для русского - 2 символа. Самая большая и дорогущая GPT-4-32k могла обрабатывать контекст длиной 32К токенов, то есть примерно 75 страниц текста, дешевая рабочая модель GPT-3-Turbo-16k - 16K токенов, 37 страниц. Кажется, что это огроменная туча текста, если заставлять GPT травить анекдоты или помогать с домашкой по литературе, но для рабочих многошаговых задач это очень мало. Например, небольшой рабочий проект с основными метаданными занимает порядка 30К токенов и уже после нескольких вопросов и манипуляций начинает задыхаться. Анализ получасового интервью на английском еле-еле вписывался в 16К, а на русском - в 32К. Вопросы-ответы по документации типа большой PDF-ки или справки сразу же требовали всю дребедень с RAG (Retrieval Augmented Generation), векторными базами, разделением на кусочки и так далее, не говоря уже о база знаний или нескольких исследований с результатами. В итоге для некоторых вещей можно было использовать API Claude с 100К контекстом, но получить у них доступ к API в Европе сложно, а лимиты в персональном аккаунте быстро заканчиваются. "
          ]
        },
        {
          "id": "4",
          "type": "IMAGE",
          "src": "/images/788e1b7f2ea9a3143c612e8b71b2dac0.png",
          "title": "Сравнение количества токенов у топовых моделей (рисовала ChatGPT, немного накосячила с подписями)"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "С возможностью обрабатывать до 128 тысяч токенов GPT-4 Turbo открывает двери для создания сложных и детальных текстов, многошаговых агентов, возможность анализировать книги, отчеты, огромную коллекцию данных без необходимости разрезать все на кусочки, сохранять историю переписки, саммаризовать и так далее. По сути вы уже сейчас можете предложить инструмент вопросов-ответов и анализа немаленького размера данных чисто на голом API (только следите за стоимостью и помните, что реально там токенов 70-80 тысяч будет активных). Можете уже сейчас переключиться в API на gpt-4-1106-preview и попробовать."
          ]
        }
      ]
    },
    {
      "id": "8",
      "title": "Павел Дуров показал концепт Telegram для Apple Vision Pro",
      "subtitle": "",
      "img": "/images/87979ff27fca421e5c9ad2c186e3e46e.jpg",
      "views": 911,
      "createdAt": "14.06.2023",
      "userId": "1",
      "type": [
        "ECONOMICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Генеральный директор Telegram Павел Дуров опубликовал в своём канале концепт версии Telegram для гарнитуры виртуальной реальности Apple Vision Pro. Дизайн интерфейса спроектирован с учётом рекомендаций Apple, а текст сообщений можно вводить голосом.",
            "В версии для visionOS окно Telegram больше напоминает десктопную версию, чем мобильную. Слева находится список чатов, строка поиска, аватарки пользователей с опубликованными историями и кнопка для создания новых чатов. С правой части расположили окно выбранного чата."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "/images/d67a64459fd9d4dc804fe42a0ee2277c.jpg",
          "title": ""
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "В коротком ролике показано, что в приложении поддерживается воспроизведение видео, голосовые сообщения, анимированные стикеры и ввод текста сообщений голосом. При этом ничего не сказано про управление."
          ]
        },
        {
          "id": "4",
          "type": "IMAGE",
          "src": "/images/631608c08c55832493b57d0e093d12a3.jpg",
          "title": ""
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Дуров не рассказал о том, планируют ли в компании выпустить приложение для Apple Vision Pro. Важно отметить, что если команда Telegram думает об этом, то пользователи увидят приложение не раньше следующего года, так как релиз самого гаджета запланирован на 2024 год."
          ]
        }
      ]
    },
    {
      "id": "9",
      "title": "Разработчики «Русов против ящеров» продали более 100 тысяч копий игры!",
      "subtitle": "... но не могут получить деньги от Steam",
      "img": "/images/41e002c371b72ea8c73140a95c4dfa84.jpg",
      "views": 952,
      "createdAt": "12.03.2023",
      "userId": "1",
      "type": [
        "ECONOMICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Суммарное количество проданных копий игры «Русы против ящеров» составляет уже более 100 тысяч штук. При этом тайтл так и не принёс разработчикам больших денег, рассказал гейм-дизайнер студии the Bratans Даниил Косачев в интервью «Газете.ру».",
            "По словам Косачева, в the Bratans не ожидали, что игра будет так хорошо продаваться. Тем не менее, около 50% заработанных на продаже тайтла денег покрывают комиссию цифровым магазинам и налоги.",
            "При этом разработчикам не удалось получить деньги от Steam из-за проблем, связанных с невозможностью переводить средства в Россию. В свою очередь, от VK Pay студия заработала пока 60 тысяч рублей, разработчики ожидают вывода этих средств.",
            "Косачев отметил, что проект «Русы против ящеров» разрабатывался на добровольной основе, сами разработчики всё ещё «являются простыми ребятами», которые создают игры в свободное от основной работы время.",
            "Релиз инди-игры «Русы против ящеров» состоялся в конце сентября. На волне популярности мемов про древних русов и рептилоидов тайтл вышел топ-10 российского Steam по продажам в первые недели после релиза."
          ]
        }
      ]
    },
    {
      "id": "10",
      "title": "Как реагировать на негатив в экспертных статьях и не потерять мотивацию",
      "subtitle": "",
      "img": "/images/89c06b1f343116bcd717e5589318d73c.png",
      "views": 492,
      "createdAt": "16.11.2023",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "В IT-сообществе принято делиться опытом решения сложных задач: это помогает найти единомышленников, получить комментарии или советы экспертов из смежных областей и компаний. Под такими материалами может появляться как позитивная обратная связь, так и негативные комментарии, которые могут демотивировать автора экспертной статьи. ",
            "При написании текстового материала вероятность получить негативный комментарий выше, чем на конференции или митапе — в живом общении люди меньше склонны высмеивать опечатки и дизайн, ставить под сомнение уместность темы или квалификацию автора.",
            "Команда HR-бренда Учи.ру решила разобраться, как реагировать на критику и негатив в комментариях, чтобы не потерять мотивацию, и почему авторам важно продолжать делиться своим опытом на внешних площадках. "
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Зачем пишут негативные комментарии",
          "paragraphs": [
            "Мы с коллегами посовещались — и думаем, что вторая причина встречается чаще. Кажется, большинство негативных комментариев появляются в сети просто из-за желания поделиться своим мнением",
            "Наш коллега Григорий Петров из Evrone считает, что виной тому — опыт, который ранее мы получали в интернете. А некоторые психологи отмечают, что роль играют анонимность и физическая удаленность от собеседника, которая позволяет менее скрупулезно придерживаться норм вежливости.",
            "Можно (и порой даже нужно) обращать внимание авторов на их недочеты и ошибки, давать полезные рекомендации. Но авторам точно будет приятнее, если делать это корректно и менее эмоционально.",
            "Интересно, что негативные комментарии люди оставляют чаще, чем позитивные. Думаем, что причиной этому тоже является культура оценок: не ставить лайки и «пятерочки» постам, которые понравились, и сервисам, которые полностью устраивают, но оставлять «единицу», если что-то вызвало негативные эмоции."
          ]
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Что делать автору, который получил негативный комментарий",
          "paragraphs": [
            "На Хабре некоторые наши коллеги тоже получают критические и негативные комментарии. Некоторые из них связаны с разницей во взглядах и опыте — тогда мы предлагаем коллеге, отвечая на них, рассмотреть точку зрения оппонента и еще раз разъяснить ему свою.",
            "Комментарии с конструктивной критикой важно отделять от необоснованного негатива. Критика помогает стать лучше, указывает на неточности и показывает точки роста. Часто негатив бывает не конструктивен — но его можно попытаться перевести в рациональное русло, попросив автора комментария выразить свою точку зрения более конкретно.",
            "Если негативные комментарии вызывают обиду, есть способ справиться с эмоциями — поделиться с друзьями своим огорчением. Особенность человеческой психики такова, что нам сложно смиряться с критикой — но если получить поддержку, станет легче."
          ]
        }
      ]
    },
    {
      "id": "11",
      "title": "Сокровища HTML",
      "subtitle": "7 тегов, которые упростят вам жизнь",
      "img": "/images/4cc8d0fcd69898d1214fe159a2555b25.png",
      "views": 1264,
      "createdAt": "05.05.2023",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "В этой статье я расскажу про 7 HTML-тегов, которые, возможно, вы еще не открыли для себя. Мы посмотрим, как они работают и насколько поддерживаются современными браузерами. Поехали!",
            "<sub> / <sup>",
            "Это теги для  добавления текста с надстрочным и подстрочным индексами.",
            "Иногда нам нужно выделить символы или цифры, которые находятся выше или ниже базовой линии текста. Например, в химии для обозначения химических формул, в математике для записи степеней и индексов, в музыке для обозначения аккордов, или просто для оформления сносок и сокращений. Все это можно легко достичь с помощью тегов <sup> и <sub>.",
            "Никаких атрибутов не требуют.",
            "Пример использования в математическом выражении:",
            "На данный момент, по статистике caniuse, поддерживаемость тегов <sup>, <sub> на уровне 96%:"
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "/images/14e9c37e5daff98ca79cb0e5977f3e7f.png",
          "title": ""
        }
      ]
    },
    {
      "id": "12",
      "title": "Xiaomi представила свой первый электромобиль Xiaomi SU7",
      "subtitle": "",
      "img": "/images/ninlzeyktf-7a1g7bfpqobwitbk.jpeg",
      "views": 8300,
      "createdAt": "01.03.2023",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Xiaomi подала заявку на лицензирование своего первого электромобиля Xiaomi SU7. Четырёхдверный седан будут производить по контракту с компанией Beijing Automotive Industry Holdings. Ранее электромобиль был известен под кодовым названием MS11.",
            "Для выхода на китайский рынок каждый автомобиль должен быть лицензирован Министерством промышленности и информатизации КНР. Регулятор ежемесячно публикует список одобренных автомобилей. Процедура вызывает недовольство автопроизводителей, поскольку они вынуждены представлять фотографии и характеристики машин, которые ещё не были выпущены."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "/images/wail2khavlvlmbyeseydxfgcx-w.jpeg",
          "title": ""
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Xiaomi SU7 имеет габариты 4997 х 1963 х 1455 мм и колёсную базу 3000 мм. Электромобиль представлен с двумя вариантами колёс: 19 и 20 дюймов. Характеристики шин — 245/45 R19 и 245/40 R20. Компания показала две версии автомобиля: с лидаром или без.",
            "Автор CarNewsChina предположил, что размещённая на стойке между передней и задней дверью камера будет обеспечивать функцию разблокировки при помощи распознавания лиц."
          ]
        },
        {
          "id": "4",
          "type": "IMAGE",
          "src": "/images/ldqwcrahhi8pg0xxqnhhfxbcz90.jpeg",
          "title": ""
        }
      ]
    },
    {
      "id": "13",
      "title": "Рисуем с нейросетями",
      "subtitle": "тонкие корректировки в Midjourney и Lumenor.ai",
      "img": "/images/65e9eacfa9486c50c3afae2299c09712.png",
      "views": 493,
      "createdAt": "15.11.2023",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Привет, Хабр! Я – Михаил Суворов, ведущий дизайнер коммуникаций в X5 Tech. В статье я расскажу несколько рабочих способов “уговорить” нейросеть нарисовать то, что вам нужно. Я использую нейросети как генераторы изображений, в первую очередь для создания иллюстраций.",
            "Если вы достаточно часто пользовались txt2img нейросетями, то есть теми инструментами, которые превращают ваш текстовый запрос в изображение, то могли заметить, что не всегда получается добиться того результата, который у вас есть “в голове”, но вы не можете заставить нейросеть более четко выполнять ваши запросы.",
            "В материале рассмотрим два ресурса, которые доступны онлайн и на сегодняшний день лучше всего справляются с задачей визуализации “по брифу от человека” – Midjourney и Lumenor.ai."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Midjourney и Vary (Region)",
          "paragraphs": [
            "В первом кейсе вся генерация и ее доработка проводилась в Midjourney. Что важно для этого кейса – мы изначально представляли, какой результат должны получить, кто будет героем в иллюстрации и общее настроение.",
            "Я предпочитаю использовать максимально детально сформулированные запросы, которые включают все детали желаемого изображения:",
            "Я намеренно пропускаю этапы, в которых я пришел именно к этому виду запроса, иначе статья будет неподъемной по количеству иллюстраций."
          ]
        },
        {
          "id": "3",
          "type": "IMAGE",
          "src": "/images/65e9eacfa9486c50c3afae2299c09712.png",
          "title": "Вот что получили"
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Нам нравится первая из 4х генераций, но в ней проигнорированы наши пожелания по тому, что у героя должна быть панама (как впоследствии оказалось, у Midjourney есть сложности с отрисовкой именно панамок), он одет совсем не так, как нам нужно.",
            "К счастью, в последнем релизе Midjourney есть функционал Vary (Region), и мы можем поэтапно доработать изображение до требуемого нам по концепции."
          ]
        },
        {
          "id": "4",
          "type": "IMAGE",
          "src": "/images/d07baf22d626344002e99fb923181b2f.png",
          "title": ""
        }
      ]
    },
    {
      "id": "14",
      "title": "Руководить, когда не готов к этому: путь от «чайка-менеджера» до «servant leader»",
      "subtitle": "",
      "img": "/images/b34d250ba8fb6c2d929ff336a399274d.png",
      "views": 403,
      "createdAt": "11.11.2023",
      "userId": "1",
      "type": [
        "ECONOMICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "С чего всё началось?",
          "paragraphs": [
            "Больше 20 лет назад я был молодым, достаточно компетентным разработчиком, и мне предложили стать руководителем отдела разработки. Казалось, что это следующий этап моего развития, поэтому я согласился. Никакого бэкграунда или подготовки у меня не было. А дальше начались приключения.",
            "Мой отдел состоял из четырёх опытных сотрудников значительно старше меня. Мне 20 лет, а им по 40+. Они дольше, чем я работали в компании, и в целом дольше существовали в роли разработчиков. Мой опыт и компетенции были для них совсем не авторитетными. В результате, когда я ставил задачи, меня могли шутливо игнорировать или объявлять какую-то испанскую забастовку. Так начались проблемы"
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "/images/50de8a9cbd55e100e236317207fd37b4.jpg",
          "title": ""
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Чем занимается руководитель?",
          "paragraphs": [
            "Меня самого смущало то, что я вообще не подозревал, чем должен заниматься руководитель.",
            "Мне казалось, что руководитель должен контролировать выполнение задач. Это классический чайка-менеджер, подходящий к сотруднику каждые 10 минут, спрашивающий как дела и когда будет готова задачка.",
            "Вторая обязанность руководителя – дольше всех сидеть в офисе, потому что если он приходит позже, то он не будет понимать, если его сотрудники опаздывают или  уходят с работы раньше. Они должны находиться восемь часов на рабочем месте, чтобы успевать делать свои задачи.",
            "Так как я знаю лучше всех, как сделать ту или иную задачу, я должен делать самые важные и критичные участки. Вот только мой опыт был не столь серьёзным как у подчинённых. Да и набор скиллов не дотягивал до любого из них.",
            "В итоге я задерживался на работе, брал на себя непомерное количество задач, разрывался между постановкой задач и собственной работой. Это всё привело к тому, что начались проблемы в семье из-за задержек на работе, в коллективе появилась демотивация и общий разброд. Через какое-то время я сбежал от этого всего в командировку в Санкт-Петербург, где провёл несколько месяцев. Это немного отодвинуло меня от команды и руководства. После этой командировки я уволился и перешёл в другую компанию."
          ]
        }
      ]
    }
  ],
  "comments": [
    {
      "id": "1",
      "text": "some comment",
      "articleId": "1",
      "userId": "1"
    },
    {
      "articleId": "18",
      "userId": "1",
      "text": "hfghg",
      "id": "iWyiy51"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "vvdfgdrf",
      "id": "ocHp6vC"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "666",
      "id": "cIpvBhB"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "аываы",
      "id": "bAVHeJd"
    },
    {
      "articleId": "14",
      "userId": "1",
      "text": "Отличная статья",
      "id": "AvGCl4f"
    },
    {
      "articleId": "5",
      "userId": "1",
      "text": "ff",
      "id": "cB50i-w"
    }
  ],
  "users": [
    {
      "id": "1",
      "username": "admin",
      "password": "123",
      "roles": [
        "ADMIN"
      ],
      "features": {
        "isArticleRatingEnabled": true,
        "isCounterEnabled": true,
        "isAppRedisigned": true
      },
      "jsonSettings": {
        "theme": "app_dark_theme",
        "isFirstVisit": true,
        "settingsPageHasBeenOpen": false,
        "isArticlePageWasOpened": true
      },
      "avatar": "https://oir.mobi/uploads/posts/2019-12/1575862596_34-57.jpg"
    },
    {
      "id": "2",
      "username": "user",
      "password": "123",
      "roles": [
        "USER"
      ],
      "features": {
        "isArticleRatingEnabled": false,
        "isCounterEnabled": false,
        "isAppRedisigned": false
      },
      "jsonSettings": {
        "isArticlePageWasOpened": true
      },
      "avatar": "https://poknok.art/uploads/posts/2022-12/1670308791_1-poknok-art-p-zloi-gus-foto-1.jpg"
    },
    {
      "id": "3",
      "username": "manager",
      "password": "123",
      "roles": [
        "MANAGER"
      ],
      "features": {
        "isArticleRatingEnabled": true,
        "isCounterEnabled": false
      },
      "jsonSettings": {
        "theme": "app_dark_theme",
        "isFirstVisit": true,
        "settingsPageHasBeenOpen": false,
        "isArticlePageWasOpened": true
      },
      "avatar": "https://poknok.art/uploads/posts/2022-12/1670308791_1-poknok-art-p-zloi-gus-foto-1.jpg"
    },
    {
      "id": "4",
      "username": "testuser",
      "password": "123",
      "roles": [
        "ADMIN"
      ],
      "features": {
        "isArticleRatingEnabled": true,
        "isCounterEnabled": false
      },
      "jsonSettings": {
        "theme": "app_dark_theme",
        "isFirstVisit": true,
        "settingsPageHasBeenOpen": false
      },
      "avatar": "https://poknok.art/uploads/posts/2022-12/1670308791_1-poknok-art-p-zloi-gus-foto-1.jpg"
    }
  ],
  "profile": [
    {
      "id": "1",
      "first": "Иван",
      "lastname": "Михайлов",
      "age": 34,
      "currency": "RUB",
      "country": "Russia",
      "city": "Москва",
      "username": "admin",
      "avatar": "https://oir.mobi/uploads/posts/2019-12/1575862596_34-57.jpg"
    },
    {
      "id": "2",
      "first": "Олег",
      "lastname": "Олегович",
      "age": 89,
      "currency": "RUB",
      "country": "Russia",
      "city": "Москва",
      "username": "userName",
      "avatar": "https://poknok.art/uploads/posts/2022-12/1670308791_1-poknok-art-p-zloi-gus-foto-1.jpg"
    },
    {
      "id": "3",
      "first": "Олег",
      "lastname": "Олегович",
      "age": 27,
      "currency": "RUB",
      "country": "Russia",
      "city": "Москва",
      "username": "manager",
      "avatar": "https://poknok.art/uploads/posts/2022-12/1670308791_1-poknok-art-p-zloi-gus-foto-1.jpg"
    },
    {
      "id": "4",
      "first": "Тестовый",
      "lastname": "Чел",
      "age": 19,
      "currency": "RUB",
      "country": "Russia",
      "city": "Москва",
      "username": "userName",
      "avatar": "https://poknok.art/uploads/posts/2022-12/1670308791_1-poknok-art-p-zloi-gus-foto-1.jpg"
    }
  ],
  "article-ratings": [
    {
      "userId": "1",
      "articleId": "7",
      "rate": 5,
      "id": 1
    },
    {
      "userId": "1",
      "articleId": "5",
      "rate": 3,
      "id": 2
    }
  ],
  "profile-ratings": []
}